import { NOTIFICATION_TYPE } from './constants'

export const NOTIFICATIONS_SEED = [
  {
    id: 501,
    userId: 1,
    createdAt: '2026-10-23T10:05:00.000Z',
    type: NOTIFICATION_TYPE.INFO,
    title: 'На складе в четверг 25 ноября выходной!',
    text: 'Здравствуйте уважаемые клиенты! Напоминаем вам, что в этот четверг 25 ноября в США праздник День Благодарения и у сотрудников склада будет выходной день.',
    isRead: false,
  },
  {
    id: 502,
    userId: 1,
    createdAt: '2026-10-23T09:10:00.000Z',
    type: NOTIFICATION_TYPE.INFO,
    title: 'Выкупаем БЕСПЛАТНО с промокодом BF2021',
    text: 'Уважаемые клиенты! С 20 до 31 ноября ВКЛЮЧИТЕЛЬНО мы выкупаем БЕСПЛАТНО из магазинов Америки. Для выкупа используйте ПРОМОКОД: BF2021.',
    isRead: false,
  },
  {
    id: 503,
    userId: 1,
    createdAt: '2026-10-23T08:20:00.000Z',
    type: NOTIFICATION_TYPE.INFO,
    title: 'Как оформлять декларации в тарифах «Суперфаст», «Фастбокс» и «Экспресс».',
    text: 'Скоро черная пятница и каждая минута будет на счету. Чтобы посылки как можно скорее вылетели к вам, мы напоминаем про важность правильного оформления деклараций ваших посылок.',
    isRead: true,
  },
  {
    id: 504,
    userId: 1,
    createdAt: '2026-10-23T08:00:00.000Z',
    type: NOTIFICATION_TYPE.INFO,
    title: '3 дня выкупаем БЕСПЛАТНО с промокодом LOCKDOWN',
    text: 'Уважаемые клиенты! С 4 по 6 ноября включительно мы выкупаем БЕСПЛАТНО из магазинов Америки. Для выкупа используйте ПРОМОКОД: LOCKDOWN.',
    isRead: true,
  },
  {
    id: 505,
    userId: 1,
    createdAt: '2026-10-23T07:00:00.000Z',
    type: NOTIFICATION_TYPE.WARNING,
    title: 'Про таможенные лимиты:',
    text: 'С 1 января 2020 года беспошлинный лимит в России составляет 200 евро и 31 кг на одну посылку или несколько посылок, если они проходят таможню одновременно, в один день. При превышении беспошлинного порога необходимо оплатить пошлину в размере 15% от суммы превышения и таможенный сбор в размере 500 рублей, а также брокерский сбор в размере 5% от их суммы.',
    isRead: true,
  },
]
